{"jobs": [{"id": "50e7c35b-5885-4596-a342-b055db8ba264", "title": "Senior Data Engineer", "department": "Engineering", "team": "Engineering", "employmentType": "FullTime", "location": "Scotland", "shouldDisplayCompensationOnJobPostings": false, "secondaryLocations": [], "publishedAt": "2025-08-18T10:06:40.788+00:00", "isListed": true, "isRemote": true, "address": {"postalAddress": {"addressRegion": "Scotland", "addressCountry": "United Kingdom", "addressLocality": "Edinburgh"}}, "jobUrl": "https://jobs.ashbyhq.com/hutora/50e7c35b-5885-4596-a342-b055db8ba264", "applyUrl": "https://jobs.ashbyhq.com/hutora/50e7c35b-5885-4596-a342-b055db8ba264/application", "descriptionHtml": "<h2><strong>About Hutora</strong></h2><p style=\"min-height:1.5em\">Hutora is on a mission to reinvent how organisations manage, develop and deploy their workforce by rethinking workflows from the ground up for the AI age. Spun out of Learnerbly (a leading workplace learning platform), and currently in stealth, Hutora is a brand new AI-first product built on seven years of insight from working closely with HR and People leaders. We’re a well-connected, well-funded and ambitious startup that has done extensive customer research – we know the real problems to solve and how to solve them. Our team has a high engineering ratio, we move fast, value intense focus, and are passionate about delivering big results. Our first technical hires will work directly with our Head of Engineering, Head of Product, and CEO, to lay the foundation of a platform that will drive the future of work.</p><p style=\"min-height:1.5em\"></p><h2><strong>Why Join Hutora?</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>High-impact, early team:</strong> Be one of our first engineers, a pivotal role where you’ll have outsized ownership and influence from day one. Your work will directly shape our product and our tech strategy.</p></li><li><p style=\"min-height:1.5em\"><strong>AI-forward &amp; innovative:</strong> Join an AI-native team pushing the boundaries of how modern software is built. We use the latest AI tools to supercharge development and product capabilities, and you’ll be at the forefront of this revolution.</p></li><li><p style=\"min-height:1.5em\"><strong>Fast-faced startup environment:</strong> Experience the intensity and thrill of an early-stage startup that’s done its homework. We operate in a fast, high-pressure environment with high expectations. You’ll grow and learn extremely quickly by solving hard, real problems.</p></li><li><p style=\"min-height:1.5em\"><strong>Competitive compensation:</strong> We offer a competitive salary and meaningful equity. You’ll share in the success you help create.</p></li></ul><p style=\"min-height:1.5em\"></p><h2><strong>What We’re Looking For</strong></h2><p style=\"min-height:1.5em\">We’re looking for formidable engineers who act like owners. You should be able to take a vague problem, break it down, and ship a solution end-to-end without hand-holding. We love <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://martinfowler.com/articles/expert-generalist.html\"><u>‘expert generalists’</u></a>, specific tech stack experience is less important to us than your ability to learn fast and adapt. We value fundamental engineering skills and the ability to collaborate with others to deliver value.</p><p style=\"min-height:1.5em\">Here are some qualities that define our ideal teammates across all roles:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Builder mentality:</strong> Proven track record of shipping software to production that solves real customer needs. You stop at nothing to accomplish the goal and can wear whatever hat necessary to get the job done.</p></li><li><p style=\"min-height:1.5em\"><strong>Startup grit:</strong> Comfortable working in ambiguity and rapidly changing environments. You’re pragmatic under pressure. When things inevitably go wrong (and they will), you stay calm, adapt, and keep moving forward.</p></li><li><p style=\"min-height:1.5em\"><strong>AI enthusiast:</strong> Hands-on experience building with AI/LLM technologies. You leverage AI tools daily to supercharge your work. You stay up-to-date on the latest AI releases, and have a critical sense for how AI can be used to create amazing customer experiences.</p></li><li><p style=\"min-height:1.5em\"><strong>Quality at speed:</strong> You write clean, reliable code but can also crank out a quick and dirty prototype when needed. You take pride in your craft but understand the need for balance, knowing when to incur tech debt and how to pay it down later. In short, you move fast without letting quality take a nose-dive.</p></li><li><p style=\"min-height:1.5em\"><strong>Growth mindset:</strong> You always believe you can learn and improve. You love learning new things, exploring new technologies, and continually improving your skills.</p></li><li><p style=\"min-height:1.5em\"><strong>Team player:</strong> Excellent communicator and collaborator. You can work closely with non-engineers (product, design, and customers) to figure out what needs to be built. You’re empathetic to end-users and your colleagues. You thrive when pairing on code and believe that knowledge-sharing makes the whole team better.</p></li><li><p style=\"min-height:1.5em\"><strong>Passion for early-stage:</strong> You love startups. Extreme ambiguity, big challenges, and hard work excite you. You take initiative, you handle responsibility, and you genuinely want to be part of building an awesome company from the ground up.</p></li><li><p style=\"min-height:1.5em\"><strong>Automation instinct:</strong> You spot repetitive toil early and squash it, wiring up CI, infrastructure-as-code, scripts, or AI agents at just the right moment to multiply your and the team’s output.</p></li></ul><p style=\"min-height:1.5em\"></p><h2><strong>About the Role</strong></h2><p style=\"min-height:1.5em\">As our first Data Engineer, you will design and own the data infrastructure that powers Hutora’s product. Our platform needs to integrate with a variety of client systems (HRIS, project management, productivity tools, etc.), and consolidate that data to drive insights and action. You will be responsible for building the pipelines to ingest data from these sources, transform and organise it in our data warehouse, and make it available to the application. This is a greenfield opportunity to set up a modern data stack from scratch.  If you get excited by the idea of a well-designed data model and a smooth-running pipeline, and you also enjoy occasionally dabbling in application code to see your data come to life, this role will scratch that itch.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Key Responsibilities:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Data pipeline development:</strong> Build robust pipelines to ingest data from various external tools and data stores used by our clients. You’ll ensure data flows reliably into our environment, handling issues like rate limits, errors, and data schema changes gracefully.</p></li><li><p style=\"min-height:1.5em\"><strong>Data warehouse and modeling:</strong> Define the schema and store all that raw data in our warehouse. Then transform it into clean, unified models that our product can use. You’ll likely use a tool like dbt to create reusable data models, applying business logic so that messy real-world data becomes a set of well-defined tables. Basically, you turn chaos into order in the data layer.</p></li><li><p style=\"min-height:1.5em\"><strong>Expose data to the product:</strong> Implement the mechanisms for our application and AI models to query this data efficiently. The goal is that our front-end and our AI can get the data needed quickly and securely, without reinventing the wheel. You’ll also think about caching, query performance, and scalability here.</p></li><li><p style=\"min-height:1.5em\"><strong>Data quality &amp; security:</strong> Be the gatekeeper of data quality. Set up validations, monitoring, and alerting to ensure the data remains trustworthy. If a pipeline fails or data looks off, you catch it before it affects customers. You’ll also work with the rest of the team to handle sensitive data appropriately, considering encryption, access controls, GDPR, and compliance considerations. Trust is key: our clients need confidence that their data is safe in our hands.</p></li><li><p style=\"min-height:1.5em\"><strong>Cross-functional collaboration:</strong> Work closely with a Forward-Deployed Engineer to understand data needs for new features. If we’re implementing a new ML model that needs training data from a customer’s usage patterns, you’ll figure out how to pipe that in. If a customer wants to integrate a new data source, you’ll help assess and integrate it. You may occasionally join technical calls with customers’ IT teams to sort out integration details. In essence, you are the bridge between external data and our internal systems.</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"><strong>Ideal Profile:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Experienced data wrangler:</strong> You have 4+ years in data engineering (or related fields like analytics engineering or backend with heavy data focus). You’re fluent in SQL and have built ETL/ELT pipelines that have handled substantial data. You know the pain of messy data and have used tools like Python, Airbyte/Fivetran, or Kafka, to move and transform data reliably.</p></li><li><p style=\"min-height:1.5em\"><strong>Modern data stack savvy:</strong> Experience with modern data warehouses (such as Snowflake, BigQuery, Redshift) and transformation tools (like dbt, or custom SQL/Python frameworks) will be very handy. You can design tables that make analytics a breeze and you understand the trade-offs of different data modeling approaches.</p></li><li><p style=\"min-height:1.5em\"><strong>Coding and scripting:</strong> While SQL is your bread and butter, you’re also comfortable writing code for data tasks. If a connector doesn’t exist, you can craft one. Bonus if you’ve dabbled in distributed data processing (Spark, Dask), but simplicity is fine too – we likely won’t be “big data” scale initially, just “medium data.”</p></li><li><p style=\"min-height:1.5em\"><strong>Detail-oriented &amp; reliable:</strong> You take data integrity seriously. Terms like “idempotent, backfill, incrementality” are part of your vocabulary when discussing pipelines. You have the tools at your disposal to document and communicate the data model to downstream stakeholders. You test your pipelines and handle edge cases with care, including missing values, weird encodings, duplicate records. In short, you sweat the details.</p></li><li><p style=\"min-height:1.5em\"><strong>Product mindset for data:</strong> You’re not just moving data for data’s sake. You’re excited about how that data powers features and insights. You enjoy brainstorming with the product team about what’s possible if we combine data X and Y. You keep the end-user in mind: how will our AI use this data to solve a real problem? This viewpoint helps you prioritise what to integrate and how to shape it.</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"><em>Why this role is exciting:</em> You’ll have the rare opportunity to build a data foundation from the very start. No legacy, just a blank canvas and modern tools. You’re the kind of person who loves setting things up “the right way” and influencing best practices from day one. Plus, this role is deeply impactful: the data pipelines you build aren’t off in a silo, they are core to the product’s value proposition. You’ll see direct connections between your work and how our AI features and users perform. Lastly, as we’re an AI-first startup, you’ll get to work closely with AI technology and see how raw data turns into intelligent features, a great chance to expand your own skill set into AI if that interests you.<br /><br /><em>Location:</em><strong> </strong>This is a hybrid role with occasional travel to Edinburgh to collaborate in person with colleagues, and infrequent travel to London to get together as a company. Travel frequency will vary based on business needs – typically ranging from once per week to once per month.<br /><br /><strong>Ready to build something amazing?</strong> If this role sounds like a fit for you, we’d love to hear from you! At Hutora, you’ll join a small, passionate team on the ground floor of an ambitious journey. It’s intense, challenging work, but also incredibly rewarding. You’ll create technology that changes how organisations operate. If you’re an expert generalist who wants to push the envelope with AI and make a real mark in an early-stage startup, get in touch.<br /></p>", "descriptionPlain": "ABOUT HUTORA\n\nHutora is on a mission to reinvent how organisations manage, develop and deploy their workforce by rethinking workflows from the ground up for the AI age. Spun out of Learnerbly (a leading workplace learning platform), and currently in stealth, Hutora is a brand new AI-first product built on seven years of insight from working closely with HR and People leaders. We’re a well-connected, well-funded and ambitious startup that has done extensive customer research – we know the real problems to solve and how to solve them. Our team has a high engineering ratio, we move fast, value intense focus, and are passionate about delivering big results. Our first technical hires will work directly with our Head of Engineering, Head of Product, and CEO, to lay the foundation of a platform that will drive the future of work.\n\n\nWHY JOIN HUTORA?\n\n - High-impact, early team: Be one of our first engineers, a pivotal role where you’ll have outsized ownership and influence from day one. Your work will directly shape our product and our tech strategy.\n\n - AI-forward & innovative: Join an AI-native team pushing the boundaries of how modern software is built. We use the latest AI tools to supercharge development and product capabilities, and you’ll be at the forefront of this revolution.\n\n - Fast-faced startup environment: Experience the intensity and thrill of an early-stage startup that’s done its homework. We operate in a fast, high-pressure environment with high expectations. You’ll grow and learn extremely quickly by solving hard, real problems.\n\n - Competitive compensation: We offer a competitive salary and meaningful equity. You’ll share in the success you help create.\n\n\nWHAT WE’RE LOOKING FOR\n\nWe’re looking for formidable engineers who act like owners. You should be able to take a vague problem, break it down, and ship a solution end-to-end without hand-holding. We love ‘expert generalists’ https://martinfowler.com/articles/expert-generalist.html, specific tech stack experience is less important to us than your ability to learn fast and adapt. We value fundamental engineering skills and the ability to collaborate with others to deliver value.\n\nHere are some qualities that define our ideal teammates across all roles:\n\n - Builder mentality: Proven track record of shipping software to production that solves real customer needs. You stop at nothing to accomplish the goal and can wear whatever hat necessary to get the job done.\n\n - Startup grit: Comfortable working in ambiguity and rapidly changing environments. You’re pragmatic under pressure. When things inevitably go wrong (and they will), you stay calm, adapt, and keep moving forward.\n\n - AI enthusiast: Hands-on experience building with AI/LLM technologies. You leverage AI tools daily to supercharge your work. You stay up-to-date on the latest AI releases, and have a critical sense for how AI can be used to create amazing customer experiences.\n\n - Quality at speed: You write clean, reliable code but can also crank out a quick and dirty prototype when needed. You take pride in your craft but understand the need for balance, knowing when to incur tech debt and how to pay it down later. In short, you move fast without letting quality take a nose-dive.\n\n - Growth mindset: You always believe you can learn and improve. You love learning new things, exploring new technologies, and continually improving your skills.\n\n - Team player: Excellent communicator and collaborator. You can work closely with non-engineers (product, design, and customers) to figure out what needs to be built. You’re empathetic to end-users and your colleagues. You thrive when pairing on code and believe that knowledge-sharing makes the whole team better.\n\n - Passion for early-stage: You love startups. Extreme ambiguity, big challenges, and hard work excite you. You take initiative, you handle responsibility, and you genuinely want to be part of building an awesome company from the ground up.\n\n - Automation instinct: You spot repetitive toil early and squash it, wiring up CI, infrastructure-as-code, scripts, or AI agents at just the right moment to multiply your and the team’s output.\n\n\nABOUT THE ROLE\n\nAs our first Data Engineer, you will design and own the data infrastructure that powers Hutora’s product. Our platform needs to integrate with a variety of client systems (HRIS, project management, productivity tools, etc.), and consolidate that data to drive insights and action. You will be responsible for building the pipelines to ingest data from these sources, transform and organise it in our data warehouse, and make it available to the application. This is a greenfield opportunity to set up a modern data stack from scratch. If you get excited by the idea of a well-designed data model and a smooth-running pipeline, and you also enjoy occasionally dabbling in application code to see your data come to life, this role will scratch that itch.\n\nKey Responsibilities:\n\n - Data pipeline development: Build robust pipelines to ingest data from various external tools and data stores used by our clients. You’ll ensure data flows reliably into our environment, handling issues like rate limits, errors, and data schema changes gracefully.\n\n - Data warehouse and modeling: Define the schema and store all that raw data in our warehouse. Then transform it into clean, unified models that our product can use. You’ll likely use a tool like dbt to create reusable data models, applying business logic so that messy real-world data becomes a set of well-defined tables. Basically, you turn chaos into order in the data layer.\n\n - Expose data to the product: Implement the mechanisms for our application and AI models to query this data efficiently. The goal is that our front-end and our AI can get the data needed quickly and securely, without reinventing the wheel. You’ll also think about caching, query performance, and scalability here.\n\n - Data quality & security: Be the gatekeeper of data quality. Set up validations, monitoring, and alerting to ensure the data remains trustworthy. If a pipeline fails or data looks off, you catch it before it affects customers. You’ll also work with the rest of the team to handle sensitive data appropriately, considering encryption, access controls, GDPR, and compliance considerations. Trust is key: our clients need confidence that their data is safe in our hands.\n\n - Cross-functional collaboration: Work closely with a Forward-Deployed Engineer to understand data needs for new features. If we’re implementing a new ML model that needs training data from a customer’s usage patterns, you’ll figure out how to pipe that in. If a customer wants to integrate a new data source, you’ll help assess and integrate it. You may occasionally join technical calls with customers’ IT teams to sort out integration details. In essence, you are the bridge between external data and our internal systems.\n\nIdeal Profile:\n\n - Experienced data wrangler: You have 4+ years in data engineering (or related fields like analytics engineering or backend with heavy data focus). You’re fluent in SQL and have built ETL/ELT pipelines that have handled substantial data. You know the pain of messy data and have used tools like Python, Airbyte/Fivetran, or Kafka, to move and transform data reliably.\n\n - Modern data stack savvy: Experience with modern data warehouses (such as Snowflake, BigQuery, Redshift) and transformation tools (like dbt, or custom SQL/Python frameworks) will be very handy. You can design tables that make analytics a breeze and you understand the trade-offs of different data modeling approaches.\n\n - Coding and scripting: While SQL is your bread and butter, you’re also comfortable writing code for data tasks. If a connector doesn’t exist, you can craft one. Bonus if you’ve dabbled in distributed data processing (Spark, Dask), but simplicity is fine too – we likely won’t be “big data” scale initially, just “medium data.”\n\n - Detail-oriented & reliable: You take data integrity seriously. Terms like “idempotent, backfill, incrementality” are part of your vocabulary when discussing pipelines. You have the tools at your disposal to document and communicate the data model to downstream stakeholders. You test your pipelines and handle edge cases with care, including missing values, weird encodings, duplicate records. In short, you sweat the details.\n\n - Product mindset for data: You’re not just moving data for data’s sake. You’re excited about how that data powers features and insights. You enjoy brainstorming with the product team about what’s possible if we combine data X and Y. You keep the end-user in mind: how will our AI use this data to solve a real problem? This viewpoint helps you prioritise what to integrate and how to shape it.\n\nWhy this role is exciting: You’ll have the rare opportunity to build a data foundation from the very start. No legacy, just a blank canvas and modern tools. You’re the kind of person who loves setting things up “the right way” and influencing best practices from day one. Plus, this role is deeply impactful: the data pipelines you build aren’t off in a silo, they are core to the product’s value proposition. You’ll see direct connections between your work and how our AI features and users perform. Lastly, as we’re an AI-first startup, you’ll get to work closely with AI technology and see how raw data turns into intelligent features, a great chance to expand your own skill set into AI if that interests you.\n\nLocation: This is a hybrid role with occasional travel to Edinburgh to collaborate in person with colleagues, and infrequent travel to London to get together as a company. Travel frequency will vary based on business needs – typically ranging from once per week to once per month.\n\nReady to build something amazing? If this role sounds like a fit for you, we’d love to hear from you! At Hutora, you’ll join a small, passionate team on the ground floor of an ambitious journey. It’s intense, challenging work, but also incredibly rewarding. You’ll create technology that changes how organisations operate. If you’re an expert generalist who wants to push the envelope with AI and make a real mark in an early-stage startup, get in touch.\n", "compensation": {"compensationTierSummary": null, "scrapeableCompensationSalarySummary": null, "compensationTiers": [], "summaryComponents": []}}, {"id": "7d137c5f-1fb0-474b-b587-8b81f612b3f6", "title": "Interim Product Lead (Early Stage)", "department": "Product", "team": "Product", "employmentType": "Contract", "location": "United Kingdom", "shouldDisplayCompensationOnJobPostings": false, "secondaryLocations": [], "publishedAt": "2025-10-02T12:23:57.079+00:00", "isListed": true, "isRemote": true, "address": {"postalAddress": {"addressCountry": "", "addressLocality": "United Kingdom"}}, "jobUrl": "https://jobs.ashbyhq.com/hutora/7d137c5f-1fb0-474b-b587-8b81f612b3f6", "applyUrl": "https://jobs.ashbyhq.com/hutora/7d137c5f-1fb0-474b-b587-8b81f612b3f6/application", "descriptionHtml": "<p style=\"min-height:1.5em\"><strong>12-month contract | Remote-first (with occasional travel to London and client offices)</strong></p><p style=\"min-height:1.5em\">We’re looking for an experienced product leader to join Hutora on a 12 month interim basis. This is a hands-on role where you’ll sit alongside the founding team, leading discovery, shaping demos to inform build, supporting sales, and driving Proof of Value engagements with clients.</p><p style=\"min-height:1.5em\">This role is best suited to someone with considerable experience in early stage environments: not just observing, but personally leading products from zero to one and into market. You’ll thrive in ambiguity, bring empathy and structure to a fast moving team, and help sharpen how our product resonates with customers.</p><p style=\"min-height:1.5em\"></p><h1><strong>About Hutora</strong></h1><p style=\"min-height:1.5em\">Hutora is on a mission to reinvent how organisations manage, develop, and deploy their workforce in the AI age. Spun out of Learnerbly (a leading workplace learning platform), and currently in stealth, Hutora is a brand new AI-first product built on seven years of insight from working closely with HR and People leaders.</p><p style=\"min-height:1.5em\">We’re a small, early stage founding team. We move fast, learn through doing, and spend as much time with customers as possible. Right now, we’re running Proof of Value engagements with forward thinking organisations to demonstrate the real business impact offered by Hutora.</p><p style=\"min-height:1.5em\"></p><h1><strong>The Role</strong></h1><p style=\"min-height:1.5em\">As our <strong>Interim Product Lead (Early Stage)</strong>, you’ll be deeply involved in the core work of building Hutora. That means touching everything from customer discovery, shaping demos, iterating prototypes, making sense of what resonates with customers and generally making sure that what needs to get done, gets done.</p><p style=\"min-height:1.5em\">You’ll also play a key role in the commercial side - supporting the CEO in sales conversations to win new Proof of Value clients, and helping turn customer insights into compelling product narratives.</p><p style=\"min-height:1.5em\">Equally important, we’re looking for someone who brings balance to the team. Our natural style leans toward speed, risk taking, and directness. We need someone comfortable with this culture and who adds empathy, structured thinking, and a communication style that blends clarity with sensitivity.</p><p style=\"min-height:1.5em\">Responsibilities will include:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Customer discovery: </strong>Lead conversations with current and prospective customers and translate insights into product direction.</p></li><li><p style=\"min-height:1.5em\"><strong>Sales support: </strong>Partner with the CEO in sales conversations to secure Proof of Value clients.</p></li><li><p style=\"min-height:1.5em\"><strong>Product development: </strong>Design and iterate demos, pilots, and Proof of Value projects that show clear impact; productise what works and learn from what doesn’t.</p></li><li><p style=\"min-height:1.5em\"><strong>Team collaboration: </strong>Bring structure to ambiguity, keeping the team aligned and focused.</p></li><li><p style=\"min-height:1.5em\"><strong>Strategic input: </strong>Contribute to strategy, fundraising prep, and customer narratives.</p></li><li><p style=\"min-height:1.5em\"><strong>GTM foundations: </strong>Feed learnings from Proof of Value engagements into early thinking on positioning, pricing, and go to market strategy.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>About You</strong></h1><p style=\"min-height:1.5em\">You could be a great fit if you:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Have worked in an early stage startup in a key role, owning product decisions in a fast changing environment.</p></li><li><p style=\"min-height:1.5em\">Have led or played a key role in taking a B2B product from zero to one - not just observing, but directly responsible for discovery, iteration, and launch decisions.</p></li><li><p style=\"min-height:1.5em\">Can create structure in ambiguous settings, bringing clarity without slowing momentum.</p></li><li><p style=\"min-height:1.5em\">Can translate nuanced customer insights into product direction that resonates with buyers and end users.</p></li><li><p style=\"min-height:1.5em\">Can think and communicate from first principles and make a clear case for your point of view.</p></li><li><p style=\"min-height:1.5em\">Bring high EQ, with the ability to read between the lines in customer and team dynamics.</p></li><li><p style=\"min-height:1.5em\">Communicate with a balance of directness and sensitivity, building trust and effective collaboration.</p></li><li><p style=\"min-height:1.5em\"><em>Bonus</em>: Experience shaping go to market strategy, particularly around positioning and pricing.</p></li><li><p style=\"min-height:1.5em\"><em>Bonus:</em> An ambitious mindset toward working with AI - curious about its potential, pragmatic about its limits, and comfortable exploring new ways to use it as the technology evolves.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>What Success Looks Like</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Customer discovery generates deep, qualitative insights that shape product direction.</p></li><li><p style=\"min-height:1.5em\">Proof of Value engagements are well structured, deliver clear outcomes, and create a foundation for repeatability.</p></li><li><p style=\"min-height:1.5em\">The team feels balanced, supported, and aligned in product decisions.</p></li><li><p style=\"min-height:1.5em\">Hutora’s product narrative is validated with customers and sharpened for go to market and investors.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">This is a rare opportunity to step into a founding team level role and shape a product at a formative stage. If you’re excited by building from scratch, working closely with customers, and leaving a lasting mark, we’d love to hear from you.</p>", "descriptionPlain": "12-month contract | Remote-first (with occasional travel to London and client offices)\n\nWe’re looking for an experienced product leader to join Hutora on a 12 month interim basis. This is a hands-on role where you’ll sit alongside the founding team, leading discovery, shaping demos to inform build, supporting sales, and driving Proof of Value engagements with clients.\n\nThis role is best suited to someone with considerable experience in early stage environments: not just observing, but personally leading products from zero to one and into market. You’ll thrive in ambiguity, bring empathy and structure to a fast moving team, and help sharpen how our product resonates with customers.\n\n\nABOUT HUTORA\n\nHutora is on a mission to reinvent how organisations manage, develop, and deploy their workforce in the AI age. Spun out of Learnerbly (a leading workplace learning platform), and currently in stealth, Hutora is a brand new AI-first product built on seven years of insight from working closely with HR and People leaders.\n\nWe’re a small, early stage founding team. We move fast, learn through doing, and spend as much time with customers as possible. Right now, we’re running Proof of Value engagements with forward thinking organisations to demonstrate the real business impact offered by Hutora.\n\n\nTHE ROLE\n\nAs our Interim Product Lead (Early Stage), you’ll be deeply involved in the core work of building Hutora. That means touching everything from customer discovery, shaping demos, iterating prototypes, making sense of what resonates with customers and generally making sure that what needs to get done, gets done.\n\nYou’ll also play a key role in the commercial side - supporting the CEO in sales conversations to win new Proof of Value clients, and helping turn customer insights into compelling product narratives.\n\nEqually important, we’re looking for someone who brings balance to the team. Our natural style leans toward speed, risk taking, and directness. We need someone comfortable with this culture and who adds empathy, structured thinking, and a communication style that blends clarity with sensitivity.\n\nResponsibilities will include:\n\n - Customer discovery: Lead conversations with current and prospective customers and translate insights into product direction.\n\n - Sales support: Partner with the CEO in sales conversations to secure Proof of Value clients.\n\n - Product development: Design and iterate demos, pilots, and Proof of Value projects that show clear impact; productise what works and learn from what doesn’t.\n\n - Team collaboration: Bring structure to ambiguity, keeping the team aligned and focused.\n\n - Strategic input: Contribute to strategy, fundraising prep, and customer narratives.\n\n - GTM foundations: Feed learnings from Proof of Value engagements into early thinking on positioning, pricing, and go to market strategy.\n\n\nABOUT YOU\n\nYou could be a great fit if you:\n\n - Have worked in an early stage startup in a key role, owning product decisions in a fast changing environment.\n\n - Have led or played a key role in taking a B2B product from zero to one - not just observing, but directly responsible for discovery, iteration, and launch decisions.\n\n - Can create structure in ambiguous settings, bringing clarity without slowing momentum.\n\n - Can translate nuanced customer insights into product direction that resonates with buyers and end users.\n\n - Can think and communicate from first principles and make a clear case for your point of view.\n\n - Bring high EQ, with the ability to read between the lines in customer and team dynamics.\n\n - Communicate with a balance of directness and sensitivity, building trust and effective collaboration.\n\n - Bonus: Experience shaping go to market strategy, particularly around positioning and pricing.\n\n - Bonus: An ambitious mindset toward working with AI - curious about its potential, pragmatic about its limits, and comfortable exploring new ways to use it as the technology evolves.\n\n\nWHAT SUCCESS LOOKS LIKE\n\n - Customer discovery generates deep, qualitative insights that shape product direction.\n\n - Proof of Value engagements are well structured, deliver clear outcomes, and create a foundation for repeatability.\n\n - The team feels balanced, supported, and aligned in product decisions.\n\n - Hutora’s product narrative is validated with customers and sharpened for go to market and investors.\n\nThis is a rare opportunity to step into a founding team level role and shape a product at a formative stage. If you’re excited by building from scratch, working closely with customers, and leaving a lasting mark, we’d love to hear from you.", "compensation": {"compensationTierSummary": null, "scrapeableCompensationSalarySummary": null, "compensationTiers": [], "summaryComponents": []}}, {"id": "f9fa9428-2052-41b9-9866-3af98e505926", "title": "Full Stack Engineer", "department": "Engineering", "team": "Engineering", "employmentType": "FullTime", "location": "United Kingdom", "shouldDisplayCompensationOnJobPostings": false, "secondaryLocations": [], "publishedAt": "2025-10-13T14:02:31.597+00:00", "isListed": true, "isRemote": true, "address": {"postalAddress": {"addressCountry": "", "addressLocality": "United Kingdom"}}, "jobUrl": "https://jobs.ashbyhq.com/hutora/f9fa9428-2052-41b9-9866-3af98e505926", "applyUrl": "https://jobs.ashbyhq.com/hutora/f9fa9428-2052-41b9-9866-3af98e505926/application", "descriptionHtml": "<h2><strong>About Hutora</strong></h2><p style=\"min-height:1.5em\">Hutora is on a mission to reinvent how organisations manage, develop and deploy their workforce by rethinking workflows from the ground up for the AI age. Spun out of Learnerbly (a leading workplace learning platform), and currently in stealth, Hutora is a brand new AI-first product built on seven years of insight from working closely with HR and People leaders. We’re a well-connected, well-funded and ambitious startup that has done extensive customer research – we know the real problems to solve and how to solve them. Our team has a high engineering ratio, we move fast, value intense focus, and are passionate about delivering big results. Our first technical hires will work directly with our Head of Engineering, Head of Product, and CEO, to lay the foundation of a platform that will drive the future of work.</p><p style=\"min-height:1.5em\"></p><h2><strong>Why Join Hutora?</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>High-impact, early team:</strong> Be one of our first engineers, a pivotal role where you’ll have outsized ownership and influence from day one. Your work will directly shape our product and our tech strategy.<br /></p></li><li><p style=\"min-height:1.5em\"><strong>AI-forward &amp; innovative:</strong> Join an AI-native team pushing the boundaries of how modern software is built. We use the latest AI tools to supercharge development and product capabilities, and you’ll be at the forefront of this revolution.<br /></p></li><li><p style=\"min-height:1.5em\"><strong>Fast-faced startup environment:</strong> Experience the intensity and thrill of an early-stage startup that’s done its homework. We operate in a fast, high-pressure environment with high expectations. You’ll grow and learn extremely quickly by solving hard, real problems.<br /></p></li><li><p style=\"min-height:1.5em\"><strong>Competitive compensation:</strong> We offer a competitive salary and<strong> </strong>meaningful equity. You’ll share in the success you help create.<br /></p></li><li><p style=\"min-height:1.5em\"><strong>Remote-first (UK):</strong> Work from anywhere in the UK. We care about output and impact, not where you sit.</p></li></ul><p style=\"min-height:1.5em\"></p><h2><strong>What We’re Looking For</strong></h2><p style=\"min-height:1.5em\">We’re looking for formidable engineers who act like owners. You should be able to take a vague problem, break it down, and ship a solution end-to-end without hand-holding. We love <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://martinfowler.com/articles/expert-generalist.html\"><u>‘expert generalists’</u></a>, specific tech stack experience is less important to us than your ability to learn fast and adapt. We value fundamental software skills and the ability to collaborate with others to deliver value.</p><p style=\"min-height:1.5em\">Here are some qualities that define our ideal teammates across all roles:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Builder mentality:</strong> Proven track record of shipping software to production that solves real customer needs. You stop at nothing to accomplish the goal and can wear whatever hat (frontend, backend, data, DevOps) necessary to get the job done.<br /></p></li><li><p style=\"min-height:1.5em\"><strong>Startup grit:</strong> Comfortable working in ambiguity and rapidly changing environments. You’re pragmatic under pressure. When things inevitably go wrong (and they will), you stay calm, adapt, and keep moving forward.<br /></p></li><li><p style=\"min-height:1.5em\"><strong>AI enthusiast:</strong> Hands-on experience building with AI/LLM technologies. You leverage AI tools daily to supercharge your work. You stay up-to-date on the latest AI releases, and have a critical sense for how AI can be used to create amazing customer experiences.<br /></p></li><li><p style=\"min-height:1.5em\"><strong>Quality at speed:</strong> You write clean, reliable code but can also crank out a quick and dirty prototype when needed. You take pride in your craft but understand the need for balance, knowing when to incur tech debt and how to pay it down later. In short, you move fast without letting quality take a nose-dive.<br /></p></li><li><p style=\"min-height:1.5em\"><strong>Growth mindset:</strong> You always believe you can learn and improve. You love learning new things, exploring new technologies, and continually improving your skills.<br /></p></li><li><p style=\"min-height:1.5em\"><strong>Team player:</strong> Excellent communicator and collaborator. You can work closely with non-engineers (product, design, and customers) to figure out what needs to be built. You’re empathetic to end-users and your colleagues. You thrive when pairing on code and believe that knowledge-sharing makes the whole team better.<br /></p></li><li><p style=\"min-height:1.5em\"><strong>Passion for early-stage:</strong> You love startups. Extreme ambiguity, big challenges, and hard work excite you. You take initiative, you handle responsibility, and you genuinely want to be part of building an awesome company from the ground up.<br /></p></li><li><p style=\"min-height:1.5em\"><strong>Automation instinct:</strong> You spot repetitive toil early and squash it, wiring up CI, infrastructure-as-code, scripts, or AI agents at just the right moment to multiply your and the team’s output.</p></li></ul><p style=\"min-height:1.5em\"></p><h2><strong>Full-Stack Engineer</strong></h2><p style=\"min-height:1.5em\"><strong>About the Role:</strong> As our Full-Stack Engineer, you will work hand-in-hand with our Head of Engineering to build the core Hutora platform. This is a broad role, working across the full application stack, from our database, through to our APIs, and UIs. We’re using modern tools (Next.js, React,TypeScript, AWS, Vercel), but we’re not obsessed with specific tech. We care that you can think across the stack and pick up new technologies on the fly. You will be turning prototype ideas into production features at a rapid pace, all while ensuring our system is scalable, maintainable, and delightful to users. If you love creating end-to-end product experiences and refuse to be put in a narrow box, this role is for you.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Key Responsibilities:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>End-to-end feature development:</strong> Build out critical product features from scratch. One day you might be creating a new AI workflow in the backend, the next day building an interface for it. You own features through the entire stack, across the database schema, application logic, frontend, and deployment. We break work down by problems to solve, not by silos.<br /></p></li><li><p style=\"min-height:1.5em\"><strong>Architect &amp; scale:</strong> Work with the Head of Engineering to design an architecture that can scale with our ambitions. You’ll make key decisions about system design, data models, and integrations. Early on, you’ll likely refactor parts of the system as we learn. We need simplicity and flexibility in our solutions, not over-engineered complexity. As a core builder, you’ll lay the technical groundwork for years to come. We may not get it right the first time, so you’re ready to evolve as we learn.<br /></p></li><li><p style=\"min-height:1.5em\"><strong>Integrate AI intelligently:</strong> Infuse the platform with AI capabilities wherever they can create value. You’ll help figure out where AI adds the most leverage and make it happen.<br /></p></li><li><p style=\"min-height:1.5em\"><strong>Code quality &amp; best practices:</strong> In a fast-moving startup, we can’t afford a quality meltdown. You’ll champion maintainable coding practices, writing tests, doing code reviews, and setting up the guardrails (CI, monitoring) that keeps our product robust. You use methods including pair programming and TDD extensively.<br /></p></li></ul><p style=\"min-height:1.5em\"><strong>Ideal Profile:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Polyglot:</strong> You have experience across the stack. Maybe you’re stronger in some areas over others, but you’ve got exposure to the whole stack and are eager to work on <em>whatever</em> is needed. From crafting a responsive UI to optimising a database query, you’re comfortable doing it all. Your ability to learn new languages and frameworks quickly is more important than knowing our exact tech stack.<br /></p></li><li><p style=\"min-height:1.5em\"><strong>Customer-focused builder:</strong> You think about the customer experience, not just the code. You care that the UI is intuitive and the API responses are fast. You have an eye for good design, but you also know how to design a database schema that won’t fall over. This balance of product thinking and engineering rigor is where you shine.<br /></p></li><li><p style=\"min-height:1.5em\"><strong>High standards, pragmatic execution:</strong> You strive for clean architecture and code, and can be pragmatic about balancing good, great, and perfect. You can make trade-offs, timebox experiments, and avoid gold-plating. Essentially, you get startup pace and don’t panic when hacking is required.<br /></p></li><li><p style=\"min-height:1.5em\"><strong>Growth and learning mindset:</strong> You stay curious and love expanding your skill set. Today it’s learning about a new AWS service, tomorrow it might be diving into MCP servers. You keep up with industry trends. We’re building something novel, so we need someone who embraces learning as a way of life.<br /></p></li><li><p style=\"min-height:1.5em\"><strong>Team-oriented:</strong> You work well in a collaborative environment. You’re happy to pair program, review code constructively, and brainstorm architecture with your colleagues. You communicate clearly, and can explain complex tech decisions in simple terms. Ultimately, you want to build <em>with</em> others, not alone.<br /></p></li></ul><p style=\"min-height:1.5em\"><em>Why this role is exciting:</em> You’ll get to build a complex, AI-driven product in an extremely hands-on way. Every feature you release will have your fingerprints on it, and you’ll constantly see your ideas reflected in the product. Few full-stack roles offer the chance to influence architecture, product direction, and engineering culture all at once. If you’ve ever wanted to architect a system from the ground up and truly own the outcome, here’s your chance. Plus, you’ll be working daily with a Head of Engineer who is eager to mentor and collaborate, so it’s a fantastic growth opportunity to level up your already-impressive skills.</p><p style=\"min-height:1.5em\"><br /><strong>Ready to build something amazing?</strong> If this role sounds like a fit for you, we’d love to hear from you! At Hutora, you’ll join a small, passionate team on the ground floor of an ambitious journey. It’s intense, challenging work, but also incredibly rewarding. You’ll create technology that changes how organisations operate. If you’re an expert generalist who wants to push the envelope with AI and make a real mark in an early-stage startup, get in touch.</p>", "descriptionPlain": "ABOUT HUTORA\n\nHutora is on a mission to reinvent how organisations manage, develop and deploy their workforce by rethinking workflows from the ground up for the AI age. Spun out of Learnerbly (a leading workplace learning platform), and currently in stealth, Hutora is a brand new AI-first product built on seven years of insight from working closely with HR and People leaders. We’re a well-connected, well-funded and ambitious startup that has done extensive customer research – we know the real problems to solve and how to solve them. Our team has a high engineering ratio, we move fast, value intense focus, and are passionate about delivering big results. Our first technical hires will work directly with our Head of Engineering, Head of Product, and CEO, to lay the foundation of a platform that will drive the future of work.\n\n\nWHY JOIN HUTORA?\n\n - High-impact, early team: Be one of our first engineers, a pivotal role where you’ll have outsized ownership and influence from day one. Your work will directly shape our product and our tech strategy.\n   \n\n - AI-forward & innovative: Join an AI-native team pushing the boundaries of how modern software is built. We use the latest AI tools to supercharge development and product capabilities, and you’ll be at the forefront of this revolution.\n   \n\n - Fast-faced startup environment: Experience the intensity and thrill of an early-stage startup that’s done its homework. We operate in a fast, high-pressure environment with high expectations. You’ll grow and learn extremely quickly by solving hard, real problems.\n   \n\n - Competitive compensation: We offer a competitive salary and meaningful equity. You’ll share in the success you help create.\n   \n\n - Remote-first (UK): Work from anywhere in the UK. We care about output and impact, not where you sit.\n\n\nWHAT WE’RE LOOKING FOR\n\nWe’re looking for formidable engineers who act like owners. You should be able to take a vague problem, break it down, and ship a solution end-to-end without hand-holding. We love ‘expert generalists’ https://martinfowler.com/articles/expert-generalist.html, specific tech stack experience is less important to us than your ability to learn fast and adapt. We value fundamental software skills and the ability to collaborate with others to deliver value.\n\nHere are some qualities that define our ideal teammates across all roles:\n\n - Builder mentality: Proven track record of shipping software to production that solves real customer needs. You stop at nothing to accomplish the goal and can wear whatever hat (frontend, backend, data, DevOps) necessary to get the job done.\n   \n\n - Startup grit: Comfortable working in ambiguity and rapidly changing environments. You’re pragmatic under pressure. When things inevitably go wrong (and they will), you stay calm, adapt, and keep moving forward.\n   \n\n - AI enthusiast: Hands-on experience building with AI/LLM technologies. You leverage AI tools daily to supercharge your work. You stay up-to-date on the latest AI releases, and have a critical sense for how AI can be used to create amazing customer experiences.\n   \n\n - Quality at speed: You write clean, reliable code but can also crank out a quick and dirty prototype when needed. You take pride in your craft but understand the need for balance, knowing when to incur tech debt and how to pay it down later. In short, you move fast without letting quality take a nose-dive.\n   \n\n - Growth mindset: You always believe you can learn and improve. You love learning new things, exploring new technologies, and continually improving your skills.\n   \n\n - Team player: Excellent communicator and collaborator. You can work closely with non-engineers (product, design, and customers) to figure out what needs to be built. You’re empathetic to end-users and your colleagues. You thrive when pairing on code and believe that knowledge-sharing makes the whole team better.\n   \n\n - Passion for early-stage: You love startups. Extreme ambiguity, big challenges, and hard work excite you. You take initiative, you handle responsibility, and you genuinely want to be part of building an awesome company from the ground up.\n   \n\n - Automation instinct: You spot repetitive toil early and squash it, wiring up CI, infrastructure-as-code, scripts, or AI agents at just the right moment to multiply your and the team’s output.\n\n\nFULL-STACK ENGINEER\n\nAbout the Role: As our Full-Stack Engineer, you will work hand-in-hand with our Head of Engineering to build the core Hutora platform. This is a broad role, working across the full application stack, from our database, through to our APIs, and UIs. We’re using modern tools (Next.js, React,TypeScript, AWS, Vercel), but we’re not obsessed with specific tech. We care that you can think across the stack and pick up new technologies on the fly. You will be turning prototype ideas into production features at a rapid pace, all while ensuring our system is scalable, maintainable, and delightful to users. If you love creating end-to-end product experiences and refuse to be put in a narrow box, this role is for you.\n\nKey Responsibilities:\n\n - End-to-end feature development: Build out critical product features from scratch. One day you might be creating a new AI workflow in the backend, the next day building an interface for it. You own features through the entire stack, across the database schema, application logic, frontend, and deployment. We break work down by problems to solve, not by silos.\n   \n\n - Architect & scale: Work with the Head of Engineering to design an architecture that can scale with our ambitions. You’ll make key decisions about system design, data models, and integrations. Early on, you’ll likely refactor parts of the system as we learn. We need simplicity and flexibility in our solutions, not over-engineered complexity. As a core builder, you’ll lay the technical groundwork for years to come. We may not get it right the first time, so you’re ready to evolve as we learn.\n   \n\n - Integrate AI intelligently: Infuse the platform with AI capabilities wherever they can create value. You’ll help figure out where AI adds the most leverage and make it happen.\n   \n\n - Code quality & best practices: In a fast-moving startup, we can’t afford a quality meltdown. You’ll champion maintainable coding practices, writing tests, doing code reviews, and setting up the guardrails (CI, monitoring) that keeps our product robust. You use methods including pair programming and TDD extensively.\n   \n\nIdeal Profile:\n\n - Polyglot: You have experience across the stack. Maybe you’re stronger in some areas over others, but you’ve got exposure to the whole stack and are eager to work on whatever is needed. From crafting a responsive UI to optimising a database query, you’re comfortable doing it all. Your ability to learn new languages and frameworks quickly is more important than knowing our exact tech stack.\n   \n\n - Customer-focused builder: You think about the customer experience, not just the code. You care that the UI is intuitive and the API responses are fast. You have an eye for good design, but you also know how to design a database schema that won’t fall over. This balance of product thinking and engineering rigor is where you shine.\n   \n\n - High standards, pragmatic execution: You strive for clean architecture and code, and can be pragmatic about balancing good, great, and perfect. You can make trade-offs, timebox experiments, and avoid gold-plating. Essentially, you get startup pace and don’t panic when hacking is required.\n   \n\n - Growth and learning mindset: You stay curious and love expanding your skill set. Today it’s learning about a new AWS service, tomorrow it might be diving into MCP servers. You keep up with industry trends. We’re building something novel, so we need someone who embraces learning as a way of life.\n   \n\n - Team-oriented: You work well in a collaborative environment. You’re happy to pair program, review code constructively, and brainstorm architecture with your colleagues. You communicate clearly, and can explain complex tech decisions in simple terms. Ultimately, you want to build with others, not alone.\n   \n\nWhy this role is exciting: You’ll get to build a complex, AI-driven product in an extremely hands-on way. Every feature you release will have your fingerprints on it, and you’ll constantly see your ideas reflected in the product. Few full-stack roles offer the chance to influence architecture, product direction, and engineering culture all at once. If you’ve ever wanted to architect a system from the ground up and truly own the outcome, here’s your chance. Plus, you’ll be working daily with a Head of Engineer who is eager to mentor and collaborate, so it’s a fantastic growth opportunity to level up your already-impressive skills.\n\n\nReady to build something amazing? If this role sounds like a fit for you, we’d love to hear from you! At Hutora, you’ll join a small, passionate team on the ground floor of an ambitious journey. It’s intense, challenging work, but also incredibly rewarding. You’ll create technology that changes how organisations operate. If you’re an expert generalist who wants to push the envelope with AI and make a real mark in an early-stage startup, get in touch.", "compensation": {"compensationTierSummary": null, "scrapeableCompensationSalarySummary": null, "compensationTiers": [], "summaryComponents": []}}], "apiVersion": "1"}